## Terraform Plan for Production Environment

**Environment**: Production
**Platform**: ECS (Fargate)
**Workspace**: production
**Branch**: main
**Triggered by**: PR #135
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.environment_key will be created
  + resource "aws_key_pair" "environment_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "tf-playground-production-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags            = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-production-key"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
        }
      + tags_all        = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-production-key"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
          + "Tier"        = "production"
        }
    }

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground_production"
      + db_subnet_group_name                  = "production-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "production-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "production-database"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.database will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "production-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "production-db-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-db-subnet-group"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_security_group_rule.database_ecs_ingress[0] will be created
  + resource "aws_security_group_rule" "database_ecs_ingress" {
      + description              = "Allow ECS tasks to access database on port 3306"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.ecs[0].aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production-ecs-cluster"
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-cluster"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-cluster"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs[0].aws_ecs_service.blue will be created
  + resource "aws_ecs_service" "blue" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "production-blue-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-service"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-service"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "flask-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs[0].aws_ecs_service.green will be created
  + resource "aws_ecs_service" "green" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "production-green-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-service"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-service"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "flask-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs[0].aws_ecs_task_definition.blue will be created
  + resource "aws_ecs_task_definition" "blue" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "production-blue-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-task"
          + "Project"     = "tf-playground"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-task"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs[0].aws_ecs_task_definition.green will be created
  + resource "aws_ecs_task_definition" "green" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "production-green-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-task"
          + "Project"     = "tf-playground"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-task"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs[0].aws_iam_policy.cloudwatch_logs_access will be created
  + resource "aws_iam_policy" "cloudwatch_logs_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to write to CloudWatch Logs"
      + id               = (known after apply)
      + name             = "production-cloudwatch-logs-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-2:*:log-group:/aws/application/tf-playground/production:*",
                          + "arn:aws:logs:us-east-2:*:log-group:/aws/application/tf-playground/production",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_policy.ecs_exec_access will be created
  + resource "aws_iam_policy" "ecs_exec_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to use ECS Exec"
      + id               = (known after apply)
      + name             = "production-ecs-exec-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_policy.parameter_store_access will be created
  + resource "aws_iam_policy" "parameter_store_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to access Parameter Store"
      + id               = (known after apply)
      + name             = "production-parameter-store-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:*:parameter/tf-playground/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-execution-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-execution-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs[0].aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "production-ecs-task-execution-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_ecs_exec will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_ecs_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_parameter_store will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "production-ecs-tasks-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-tasks-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-tasks-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.loadbalancer[0].aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "production-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "production-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.loadbalancer[0].aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "production-alb-http-listener"
        }
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-http-listener"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.loadbalancer[0].aws_lb_listener_rule.green[0] will be created
  + resource "aws_lb_listener_rule" "green" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Name" = "production-green-listener-rule"
        }
      + tags_all     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-listener-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/green*",
                  + "/green/*",
                ]
            }
        }
    }

  # module.loadbalancer[0].aws_lb_target_group.blue[0] will be created
  + resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "production-blue-tg-ecs"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "production-blue-tg-ecs"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-tg-ecs"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer[0].aws_lb_target_group.green[0] will be created
  + resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "production-green-tg-ecs"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "production-green-tg-ecs"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-tg-ecs"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer[0].aws_security_group_rule.alb_ecs_egress[0] will be created
  + resource "aws_security_group_rule" "alb_ecs_egress" {
      + description              = "Allow outbound traffic to ECS tasks on port 8080"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "egress"
    }

  # module.logging.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "tf-playground-production"
      + id             = (known after apply)
    }

  # module.logging.aws_cloudwatch_metric_alarm.high_error_rate[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high_error_rate" {
      + actions_enabled                       = true
      + alarm_description                     = "High 5XX error rate detected"
      + alarm_name                            = "high-error-rate-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # module.logging.aws_cloudwatch_metric_alarm.slow_response_time[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "slow_response_time" {
      + actions_enabled                       = true
      + alarm_description                     = "Slow response time detected"
      + alarm_name                            = "slow-response-time-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + threshold                             = 2
      + treat_missing_data                    = "missing"
    }

  # module.networking.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Project"     = "tf-playground"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.networking.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "production-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database (MySQL from webservers)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.webserver will be created
  + resource "aws_security_group" "webserver" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers (HTTP, SSH, egress)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-webserver-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group_rule.webserver_alb_ingress will be created
  + resource "aws_security_group_rule" "webserver_alb_ingress" {
      + description              = "Allow HTTP traffic on port 8080 from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.networking.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Project"     = "tf-playground"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                     = (known after apply)
  + alb_url                          = (known after apply)
  + alb_zone_id                      = (known after apply)
  + application_log_group_name       = "/aws/application/tf-playground/production"
  + application_url                  = (known after apply)
  + blue_ecs_service_name            = "production-blue-service"
  + blue_target_group_arn            = (known after apply)
  + cloudwatch_dashboard_url         = "https://console.aws.amazon.com/cloudwatch/home?region=us-east-2#dashboards:name=tf-playground-production"
  + database_endpoint                = (known after apply)
  + database_name                    = "tfplayground_production"
  + database_port                    = (known after apply)
  + db_password                      = (sensitive value)
  + db_secret_arn                    = "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/db-pword-EcXlE2"
  + db_secret_name                   = "/tf-playground/all/db-pword"
  + db_username                      = "tfplayground_user"
  + deployment_timestamp             = "Deployed via GitFlow CI/CD - Production Environment"
  + deployment_validation_url        = (known after apply)
  + ecr_repository_url               = "123324351829.dkr.ecr.us-east-2.amazonaws.com/global-tf-pg-ecr"
  + ecs_cluster_name                 = "production-ecs-cluster"
  + ecs_tasks_security_group_id      = (known after apply)
  + environment_summary              = {
      + alb_dns_name      = (known after apply)
      + application_url   = (known after apply)
      + blue_asg_name     = null
      + database_endpoint = (known after apply)
      + environment       = "production"
      + green_asg_name    = null
      + region            = "us-east-2"
      + ssh_key_name      = "tf-playground-production-key"
      + vpc_id            = (known after apply)
    }
  + global_alarm_log_group_arn       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/production"
  + global_application_log_group_arn = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/production"
  + global_log_group_arns            = {
      + alarm       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/production"
      + application = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/production"
      + system      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/production"
    }
  + global_system_log_group_arn      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/production"
  + green_ecs_service_name           = "production-green-service"
  + green_target_group_arn           = (known after apply)
  + health_check_url                 = (known after apply)
  + high_error_rate_alarm_arn        = (known after apply)
  + http_listener_arn                = (known after apply)
  + private_subnet_ids               = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                = [
      + (known after apply),
      + (known after apply),
    ]
  + slow_response_time_alarm_arn     = (known after apply)
  + ssh_key_name                     = "tf-playground-production-key"
  + ssh_private_key                  = (sensitive value)
  + ssh_public_key                   = (sensitive value)
  + system_log_group_name            = "/aws/ec2/tf-playground/production"
  + vpc_id                           = (known after apply)

  ```
  
  </details>